{
  "architectures": ["GemmaForCausalLM"],
  "model_type": "gemma",
  "torch_dtype": "float16",
  "num_hidden_layers": 28,
  "num_attention_heads": 16,
  "hidden_size": 3072,
  "intermediate_size": 24576,
  "vocab_size": 256000,
  "max_position_embeddings": 8192,
  "rms_norm_eps": 1e-06,
  "tie_word_embeddings": true,
  "samos_version": "4.0-sentient",
  "distillation_teacher": "336B-Collective"
}
